Repository: sbarrientos8-cmyk/TFG-WalkPaws
Catalog: Resources/Language/Localizable.xcstrings
Source language: en
Languages: es

source: Accept
es: Aceptar

source: Add image
es: Añadir imagen

# amount_must_be_valid_greater_than_zero
source: The amount must be a valid number greater than 0.
es: El importe debe ser un número válido mayor que 0.

source: Cancel
es: Cancelar

# cannot_donate_more_than_eur
source: You cannot donate more than %.2f€.
es: No puedes donar más de %.2f€.

# cannot_donate_more_than_points
source: You cannot donate more than %d points.
es: No puedes donar más de %d puntos.

source: Card number
es: Número de tarjta

source: Cardholder name
es: Nombre titular

source: Change image
es: Cambiar imagen

source: Change language
es: Cambiar idioma

# changes_saved_successfully
source: The changes have been saved successfully.
es: Los cambios se han guardado correctamente.

source: Check your data
es: Revisa tus datos

# code_resent_check_email
source: Code resent. Check your email.
es: Código enviado. Revisa tu correo.

# confirm_delete_post
source: Are you sure you want to delete this post?
es: ¿Estás seguro que quieres eliminar esta publicación?

# confirm_log_out
source: Are you sure you want to log out?
es: ¿Seguro que quieres cerrar sesión?

source: Confirm password
es: Confirmar contraseña

source: Contact
es: Contactar

# contact_email_body
source: New message for the shelter: %@ User: %@ Email: %@ Reason: %@ Message: %@
es: Nuevo mensaje para el refugio: %@ Usuario: %@ Email: %@ Motivo: %@ Mensaje: %@

source: Contact us
es: Contactar con nosotros

source: Contact WalkPaws
es: Contactar WalkPaws

# could_not_check_location
source: Could not verify location
es: No se pudo comprobar la ubicación

# could_not_check_shelter_location
source: The shelter location could not be checked.
es: No se pudo comprobar la ubicación del refugio.

# could_not_finish_location_not_verified
source: The walk cannot be finished because your location or the shelter's location could not be verified.
es: No se puede finalizar porque no se pudo comprobar tu ubicación o la del refugio.

# could_not_get_profile
source: Your profile could not be retrieved.
es: No se pudo obtener tu perfil.

# could_not_get_session_log_in_again
source: Your session could not be retrieved. Please log in again.
es: No se pudo obtener tu sesión. Vuelve a iniciar sesión.

# could_not_log_out_try_again
source: Could not log out. Please try again.
es: No se pudo cerrar sesión. Inténtalo de nuevo.

# could_not_publish_try_again
source: The post could not be published. Please try again.
es: No se pudo publicar. Inténtalo de nuevo.

# could_not_resend_code
source: The code could not be resent.
es: No se pudo reenviar el código.

# could_not_send_code_try_again
source: The code could not be sent. Please try again
es: No se pudo enviar el código. Intenta de nuevo

# could_not_update_password
source: The password could not be updated.
es: No se pudo actualizar la contraseña.

source: Delete
es: Eliminar

source: Delete post
es: Eliminar publicación

source: Description
es: Descripción

# description_label
source: Description:
es: Descripción:

# didnt_receive_code_resend_code
source: Didn’t receive the code? Resend code
es: ¿No recibiste el código? Reenviar código

# distance_too_far_to_start_walk
source: You are %.2f km away. Please get a bit closer (≈ 1 km) to start the walk.
es: Estás a %.2f km. Acércate un poco más (≈ 1 km) para empezar el paseo.

source: Dog
es: Perro

# dog_age_years
source: %@ years old
es: %@ años

source: Dog detail
es: Detalle del perro

# dog_goal_already_reached
source: This dog has already reached its goal. Thank you!
es: Este perro ya ha alcanzado su objetivo. ¡Gracias!

source: Dogs
es: Perros

source: Dogs available for walks
es: Perros disponibles para pasear

# dogs_need_your_company
source: There are dogs that need your company!
es: ¡Hay perros que necesitan tu compañía!

source: Donate
es: Donar

# donate_points_to_complete
source: If you want to complete the donation, donate %d points.
es: Si quieres completar la donación, dona %d puntos.

source: Donate with card
es: Donar con tarjeta

source: Donate with points
es: Donar con puntos

source: Donation completed
es: Donación completada

# donation_completed_banner
source: The donation has been completed!
es: ¡La donación se ha completado!

# dont_have_account_sign_up
source: Don’t have an account? Sign up
es: ¿No tienes cuenta? Registrate

source: Edit image
es: Editar imagen

source: Edit profile
es: Editar perfil

source: Email
es: Correo electrónico

# email_label
source: Email:
es: Correo electrónico:

# enable_location_to_start_walk
source: Enable location to start the walk.
es: Activa la ubicación para empezar el paseo.

source: English
es: Inglés

# enter_amount_in_euros
source: Enter the amount in euros.
es: Introduce el importe en euros.

# enter_card_details_and_amount
source: Enter your card details and the amount you want to donate
es: Añadir los datos de tu tarjeta y el importe que quieres donar

# enter_card_number
source: Enter the card number.
es: Introduce el número de tarjeta.

# enter_cardholder_name
source: Enter the cardholder name.
es: Introduce el nombre del titular.

# enter_cvc
source: Enter the CVC.
es: Introduce el CVC.

# enter_expiration_date
source: Enter the expiration date.
es: Introduce la fecha de caducidad.

# enter_points_to_donate
source: Enter the points you want to donate.
es: Introduce los puntos que quieres donar.

# enter_valid_code_first
source: Please enter a valid code first.
es: Primero introduce un código válido.

# enter_valid_email
source: Enter a valid email
es: Introduce un correo válido

source: Enter your email
es: Introduce tu correo

# error_donating_by_card_try_again
source: Error donating by card. Please try again.
es: Error al donar con tarjeta. Inténtalo de nuevo.

# error_donating_points_try_again
source: Error donating points. Please try again.
es: Error al donar puntos. Inténtalo de nuevo.

source: Error loading
es: Error al cargar

source: Error loading shelters.
es: Error cargando refugios.

source: Explore dog shelters in your area
es: Explora refugios de perros en tu área

# fill_all_fields
source: Fill in all fields
es: Rellena todos los campos

# fill_both_passwords
source: Fill in both password fields.
es: Rellena ambas contraseñas.

source: Find shelters
es: Buscar refugios

# finish_current_walk_first
source: You cannot start another walk until you finish the current one.
es: No puedes empezar otro paseo hasta que termines el actual.

source: Finish walk
es: Terminar paseo

# first_walk_will_appear_here
source: Take your first walk and you will see it here.
es: Haz tu primer paseo y lo verás aquí.

# forgot_password
source: I forgot my password
es: He olvidado mi contraseña

source: Full name
es: Nombre completo

source: Hello
es: Hola

# image_label
source: Image:
es: Imagen:

source: Image selected ✅
es: Imagen seleccionada ✅

# incorrect_verification_code
source: The code is incorrect
es: El código es incorrecto

source: Invalid card number.
es: Número de tarjeta no válido.

# invalid_cvc
source: Invalid CVC. It must have 3 or 4 digits.
es: CVC no válido. Debe tener 3 o 4 dígitos.

# invalid_date_use_mmyy
source: Invalid date. Use MMYY format (e.g. 0728).
es: Fecha no válida. Usa formato MMYY (ej: 0728).

source: Invalid dog ID.
es: DogId inválido.

source: Invalid email
es: Email inválido

source: Loading…
es: Cargando…

source: Location not available
es: Ubicación no disponible

source: Log In
es: Iniciar Sesión

source: Log out
es: Cerrar sesión

source: Make a shelter dog happy
es: Haz feliz a un perro refugiado

# make_donation
source: Make a donation
es: Realizar donación

source: Message
es: Mensaje

source: Missing data
es: Faltan datos

# missing_email
source: Email is missing
es: Falta el email

source: MM/YY
es: MM/AA

# must_be_closer_to_finish_walk
source: You are %.2f km away. You must be within 1 km or less to finish the walk.
es: Estás a %.2f km. Debes estar a 1 km o menos para finalizar el paseo.

source: My posts
es: Mis publicaciones

source: My walks
es: Mis paseos

# name_label
source: Name:
es: Nombre:

source: Need support
es: Necesitan apoyo

source: Needs support
es: Necesita apoyo

source: New email
es: Nuevo correo electrónico

source: New name
es: Nuevo nombre

source: New Password
es: Nueva Contraseña

source: New post
es: Añadir publicación

# news_will_appear_here
source: When there are news posts, they will appear here.
es: Cuando haya noticias aparecerán aquí.

source: No description
es: Sin descripción

source: No diagnosis
es: Sin diagnóstico

# no_dogs_available_in_category
source: There are currently no dogs available in this category.
es: Ahora mismo no hay perros disponibles en esta categoría.

source: No location
es: Sin ubicación

# no_needy_dogs
source: There are no dogs needing support
es: No hay perros que necesiten apoyo

source: No posts
es: No hay publicaciones

# no_posts_yet
source: You have no posts yet
es: No tienes publicaciones aún

source: No results for “%@”
es: No hay resultados para “%@”

source: No shelters available.
es: No hay refugios disponibles

# no_special_needs_dogs_in_shelter
source: There are currently no dogs with special needs in this shelter.
es: Ahora mismo no hay perros con necesidades especiales en este refugio

# no_stable_dogs
source: There are no stable dogs
es: No hay perros estables

source: No walks yet
es: No hay paseos aún

# not_enough_points_you_have
source: You do not have enough points. You have %d.
es: No tienes suficientes puntos. Tienes %d.

# not_near_shelter
source: You are not near the shelter
es: No estás cerca del refugio

source: Now
es: Ahora

source: Password
es: Contraseña

source: Password changed
es: Contraseña cambiada

# password_label
source: Password:
es: Contraseña:

# password_min_6_characters
source: The password must be at least 6 characters long.
es: La contraseña debe tener al menos 6 caracteres.

# password_updated_successfully
source: Your password has been updated successfully.
es: Tu contraseña se ha actualizado correctamente.

source: Passwords do not match
es: Las contraseñas no coinciden

source: Points
es: Puntos

# points_missing_to_complete_donation
source: You need %d more points to complete the donation.
es: Para completar la donación te faltan %d puntos.

# points_must_be_greater_than_zero
source: Points must be a number greater than 0.
es: Los puntos deben ser un número mayor que 0.

# points_placeholder
source: Points
es: Puntos

# post_created_successfully
source: Your post has been created successfully.
es: Tu publicación se ha creado correctamente.

source: Post detail
es: Detalle de la publicación

# posts_will_appear_here
source: When you create a post, it will appear here.
es: Cuando crees una publicación, aparecerá aquí.

source: Publish
es: Publicar

# published_success
source: Published ✅
es: Publicado ✅

# raised_amount
source: Raised: %@
es: Recaudado: %@

# ready_to_walk
source: Ready to go for a walk?
es: ¿Listo para pasear?

source: Reason
es: Motivo

source: Recover Password
es: Recuperar Contraseña

# remaining_amount
source: Remaining: %@
es: Faltan: %@

source: Save
es: Guardado

source: Save changes
es: Guardar cambios

source: Saved
es: Guardado

source: Saving...
es: Guardando…

source: Search dogs
es: Buscar perros

source: Search shelter, city...
es: Buscar refugio, ciudad...

source: Select dog
es: Selecciona un perro

source: Select shelter
es: Selecciona un refugio

source: Select shelter and dog
es: Selecciona un refugio y un perro

source: Send
es: Enviar

source: Send Code
es: Enviar código

source: Sending code...
es: Enviando código…

source: Shelter
es: Refugio

source: Shelter without location
es: Refugio sin ubicación

# shelter_without_saved_coordinates
source: This shelter does not have saved coordinates.
es: Este refugio no tiene coordenadas guardadas.

source: Sign up
es: Registrarse

source: Spanish
es: Español

source: Stable
es: Estables

source: Start walk
es: Empezar paseo

# still_far_from_shelter
source: You are still far from the shelter
es: Aún estás lejos del refugio

source: Story
es: Historia

# title_and_description_required
source: You must write at least a title and a description.
es: Debes escribir al menos un título y una descripción.

# title_label
source: Title:
es: Título:

source: Unknown age
es: Edad desconocida

source: User
es: Usuario

source: Verification code
es: Código de verificación

source: View dogs
es: Ver perros

source: View map
es: Ver mapa

source: View news
es: Ver noticias

source: View shelters
es: Ver refugios

source: Walk
es: Pasear

# walk_already_in_progress
source: You already have a walk in progress
es: Ya tienes un paseo en curso

# walk_details_title
source: WALK DETAILS:
es: DATOS DEL PASEO:

# walk_not_saved_min_distance
source: The walk will not be saved because you have not walked at least 0.3 km. Distance: %@
es: No se guardará el paseo porque no has recorrido al menos 0,3 km. Distancia: %@

source: Walk summary
es: Resumen del paseo

# walk_summary_message
source: %@ Dog: %@ ⏱ Time: %@ 📏 Distance: %@ 🧭 Recorded points: %d
es: Refugio: %@ Perro: %@ ⏱ Tiempo: %@ 📏 Distancia: %@ 🧭 Puntos registrados: %d

source: Walk too short
es: Paseo demasiado corto

# we_will_send_code_to_reset_password
source: We will send you a code to reset your password
es: Te enviaremos un código para restablecer tu contraseña

# write_description
source: Write the description...
es: Escribe la descripción…

# write_reason
source: Write the reason
es: Escribe el motivo

# write_title
source: Write the title
es: Escribe el título

source: Write your message...
es: Escribe tu mensaje…

# you_have_points_equivalent_eur
source: You have %d points (≈ %@€).
es: Tienes %d puntos (≈ %@€).
